# DocumentOpeningEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentOpeningEventArgs Class
Members See Also
---
The event arguments used by the DocumentOpening event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public class DocumentOpeningEventArgs : RevitAPIPreEventArgs
```

Visual Basic
---
```text
Public Class DocumentOpeningEventArgs _
	Inherits RevitAPIPreEventArgs
```

Visual C++
---
```text
public ref class DocumentOpeningEventArgs : public RevitAPIPreEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.DB.Events..::..DocumentOpeningEventArgs
# See Also
DocumentOpeningEventArgs Members
Autodesk.Revit.DB.Events Namespace